#include <iostm8s207.h>
#include <timerOneDelay.h>
int _STM_TIM_Fr = 2;


void delay_us(unsigned int a) {   

 TIM1_PSCRH = 0x00;//устанавливаем прескеллер   
 TIM1_PSCRL = _STM_TIM_Fr - 1;//устанавливаем прескеллер 16   
 TIM1_EGR |= 1;//принудительно сохраняем параметры прескеллера   
 TIM1_CR1 |= 1<<2;//отключаем срабатывание переполнения   
 TIM1_ARRH = 0x00+(a>>8); //устанавливаем порог счета считаем до 19   
 TIM1_ARRL = 0x00+a; //устанавливаем порог счета   
 TIM1_CR1 |= 0x01 | (1<<3);//включаем таймер одноразово   
    
 while(((TIM1_SR1 & 0x01) != 0x01) && a != 0) { //если не переполнились.  
 }   
 TIM1_SR1 &= ~0x01;  
}
 
 void delay_ms(unsigned int a) {
 
 int f = (_STM_TIM_Fr*1000) - 1;
 TIM1_PSCRH = f>>8;//устанавливаем прескеллер   
 TIM1_PSCRL = f & 0xff;//устанавливаем прескеллер 16000   
 TIM1_EGR |= 1;//принудительно сохраняем параметры прескеллера   
 TIM1_CR1 |= 1<<2;//отключаем срабатывание переполнения   
 TIM1_ARRH = 0x00+(a>>8); //устанавливаем порог счета считаем до 19   
 TIM1_ARRL = 0x00+a; //устанавливаем порог счета   
 TIM1_CR1 |= 0x01 | (1<<3);//включаем таймер одноразово   
    
 while(((TIM1_SR1 & 0x01) != 0x01) && a != 0) { //если не переполнились.  
 }   
 TIM1_SR1 &= ~0x01;  
}

void set_F_MHz(int f) {
	_STM_TIM_Fr = f;
}
